const {Check} = require('../CheckString');
module.exports = {
    VisualMemoryWords(answers) {
        let original = [
            ["деятельность", "мораль", "норма", "свобода", "метод", "смысл", "ценность", "проект", "успех", "познание"],
            ["свобода", "проект", "мораль", "норма", "ценность", "метод", "смысл", "успех", "деятельность", "познание"],
            ["мораль", "деятельность", "свобода", "метод", "норма", "познание", "успех", "смысл", "ценность", "проект"],
            ["проект", "норма", "метод", "деятельность", "мораль", "свобода", "ценность", "познание", "успех", "смысл"],
            ["норма", "проект", "деятельность", "ценность", "метод", "смысл", "мораль", "свобода", "познание", "успех"],
            ["познание", "успех", "ценность", "проект", "смысл", "метод", "деятельность", "норма", "свобода", "мораль"],
            ["успех", "свобода", "проект", "смысл", "деятельность", "ценность", "норма", "мораль", "познание", "метод"],
            ["свобода", "познание", "смысл", "мораль", "ценность", "норма", "проект", "метод", "успех", "деятельность"],
            ["познание", "ценность", "успех", "деятельность", "свобода", "проект", "метод", "смысл", "мораль", "норма"],
            ["смысл", "метод", "проект", "успех", "норма", "познание", "свобода", "деятельность", "ценность", "мораль"]
        ]
    
        let result = 0;
        let random = answers[answers.length - 2];
        let element = original[random];
    
        for (let i = 0; i < answers.length - 2; i++) {
            if (element.includes(answers[i])) {
                result += 0.5;
                if (element[i] == answers[i]) {
                    result += 0.5;
                }
            }
        }
    
        let timer = answers[answers.length - 1];
    
        result /= 10;
        return result;
    }
}